/*企业发放的奖金根据利润提成。利润Ⅰ低于或等于 100000 元的,奖金可提 10%;
利润高于 100000 元,低于 200000 元(100000<I≤200000)时,低于 100000 元的部分按10%提成,高于100000元的部分,可提成7.5%;
200000<I≤400000时,低于 200000元的部分仍按上述办法提成(下同)。高于 200000 元的部分按 5%提成;
400000<I≤600000 元时,高于 400000 元的部分按 3%提成;
600000<I≤1000000 时,高于 600000元的部分按 1.5%提成;I>1000000 时,超过 1000000 元的部分按 1%提成。
从键盘输入当月利润Ⅰ,求应发奖金总数。
要求:
（1）用 if 语句编程序﹔(2)用 switch 语句编程序。*/


/*（1）用 if 语句编程序*/
/*
#include<iostream>
using namespace std;
int main()
{
	double i;
	cout << "请输入当月利润：";
	cin >> i;
	double n;
	if (i <= 100000)
	{
		n = i * 0.1;
	}
	else if (i > 100000 && i <= 200000)
	{
		n = 100000 * 0.1 + (i - 100000) * 0.075;
	}
	else if (i > 200000 && i <= 400000)
	{
		n = 100000 * 0.1 + 100000 * 0.075 + (i - 200000) * 0.05;
	}
	else if (i > 400000 && i <= 600000)
	{
		n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (i - 400000) * 0.03;
	}
	else if (i > 600000 && i <= 1000000)
	{
		n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.003 + (i - 600000) * 0.015;
	}
	else
	{
		n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.003 + 400000 * 0.015 + (i - 1000000) * 0.01;
	}
	cout << "应发奖金总数为：" << n;
	return 0;
}
*/



/*(2)用 switch 语句编程序*/

#include<iostream>
using namespace std;
int main()
{
	int i;
	cout << "请输入当月利润：";
	cin >> i;
		double n;
		int m = 0;
	if (i <= 100000)
	{
		m=0;
	}
	else if (i > 100000 && i <= 200000)
	{
		m=1;
	}
	else if (i > 200000 && i <= 400000)
	{
		m=2;
	}
	else if (i > 400000 && i <= 600000)
	{
		m=3;
	}
	else if (i > 600000 && i <= 1000000)
	{
		m=4;
	}
	else
	{
		m=5;
	}
	switch(m)
	{
	case 0:	n = i * 0.1;break;
	case 1:n = 100000 * 0.1 + (i - 100000) * 0.075;break;
	case 2:n = 100000 * 0.1 + 100000 * 0.075 + (i - 200000) * 0.05;break;
	case 3:n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (i - 400000) * 0.03;break;
	case 4:n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.003 + (i - 600000) * 0.015;break;
	case 5:n = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.003 + 400000 * 0.015 + (i - 1000000) * 0.01;break;
	}
	cout << "应发奖金总数为：" << n;
	return 0;
}

